In [3]:
import pandas as pd

# First DataFrame
df1 = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [24, 27, 22, 32]
})

# Second DataFrame
df2 = pd.DataFrame({
    'id': [3, 4, 5, 6],
    'city': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'salary': [70000, 80000, 55000, 60000]
})

print("DataFrame 1:")
print(df1)
print("\nDataFrame 2:")
print(df2)

DataFrame 1:
   id     name  age
0   1    Alice   24
1   2      Bob   27
2   3  Charlie   22
3   4    David   32

DataFrame 2:
   id         city  salary
0   3     New York   70000
1   4  Los Angeles   80000
2   5      Chicago   55000
3   6      Houston   60000

In [4]:
pd.merge(df1, df2, on="id", how="outer").set_index("id")

       name   age         city   salary
id
1     Alice  24.0          NaN      NaN
2       Bob  27.0          NaN      NaN
3   Charlie  22.0     New York  70000.0
4     David  32.0  Los Angeles  80000.0
5       NaN   NaN      Chicago  55000.0
6       NaN   NaN      Houston  60000.0